jkalend/VUT-IMP/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTE24 (number 20), J1[12]/D5-TPM0_CH0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S3_PS_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S3_PS_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_S3_PS_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S3_PS_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_S3_PS_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_S3_PS_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTE31 (number 19), J2[2]/D8-TPM0_CH4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S3_G2_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S3_G2_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_S3_G2_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S3_G2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_S3_G2_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_S3_G2_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTA12 (number 28), J1[6]/D2-TPM1_CH0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S3_PG_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S3_PG_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_S3_PG_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S3_PG_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_S3_PG_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_S3_PG_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTE16 (number 8), J4[2]/A0-ADC0_SE1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S2_PS_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S2_PS_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_S2_PS_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S2_PS_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_S2_PS_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_S2_PS_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTE20 (number 9), J4[6]/A2-ADC0_SE0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S1_PR_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S1_PR_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_S1_PR_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S1_PR_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_S1_PR_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_S1_PR_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTE21 (number 10), J4[8]/A3-ADC0_SE4A
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S1_PS_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S1_PS_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_S1_PS_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S1_PS_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_S1_PS_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_S1_PS_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB1 (number 36), J4[10]/A4-I2C0_SDA/ADC0_SE9
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S1_G1_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S1_G1_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S1_G1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S1_G1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_S1_G1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_S1_G1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTB0 (number 35), J4[12]/A5-I2C0_SCL/ADC0_SE8
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S1_O_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S1_O_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S1_O_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S1_O_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_S1_O_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_S1_O_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTD7 (number 64), J2[20]/J23[1]/D15-I2C1_SCL
  @{ */

