jkalend/VUT-IMP/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_S2_G2_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S2_G2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S2_G2_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S2_G2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_S2_G2_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_S2_G2_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTD6 (number 63), J2[18]/J24[1]/D14-I2C1_SDA
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S2_G1_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S2_G1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S2_G1_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S2_G1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_S2_G1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_S2_G1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC5 (number 50), J2[12]/D13-SPI0_SCK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S2_O_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S2_O_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S2_O_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S2_O_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_S2_O_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_S2_O_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTC7 (number 52), J2[10]/D12-SPI0_MISO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S2_R_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S2_R_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S2_R_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S2_R_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_S2_R_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_S2_R_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTC6 (number 51), J2[8]/D11-SPI0_MOSI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S3_G1_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S3_G1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S3_G1_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S3_G1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_S3_G1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_S3_G1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC4 (number 49), J2[6]/D10-SPI0_CS0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S3_O_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S3_O_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S3_O_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S3_O_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_S3_O_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_S3_O_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTC8 (number 53), J1[16]/D7-TPM0_CH4/CMP0_IN2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S2_PG_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S2_PG_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S2_PG_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S2_PG_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_S2_PG_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_S2_PG_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC9 (number 54), J1[14]/D6-TPM0_CH5/CMP0_IN3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S2_PR_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S2_PR_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S2_PR_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S2_PR_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_S2_PR_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_S2_PR_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA1 (number 23), J1[2]/J25[1]/D0-UART0_RX
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S1_G2_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S1_G2_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S1_G2_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S1_G2_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_S1_G2_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_S1_G2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA2 (number 24), J1[4]/J26[1]/D1-UART0_TX
  @{ */

