jkalend/VUT-IMP/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_S1_R_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S1_R_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S1_R_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S1_R_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_S1_R_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_S1_R_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE25 (number 21), J1[8]/D3-TPM0_CH1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S3_PR_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S3_PR_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_S3_PR_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S3_PR_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_S3_PR_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_S3_PR_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC0 (number 43), J4[4]/A1-ADC0_SE14
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S1_PG_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S1_PG_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S1_PG_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S1_PG_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_S1_PG_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_S1_PG_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA5 (number 27), J2[4]/D9-TPM0_CH2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_S3_R_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_S3_R_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_S3_R_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_S3_R_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_S3_R_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_S3_R_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtonsPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTSIPins(void);

#define SOPT5_LPUART0RXSRC_CMP0 0x01u /*!<@brief LPUART0 Receive Data Source Select: CMP0 output */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL_I2CPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMAGNET_I2CPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTHERPins(void);

/*! @name PORTA18 (number 32), EXTAL_32KHZ
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EXTAL0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_EXTAL0_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_EXTAL0_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA19 (number 33), XTAL_32KHZ
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_XTAL0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_XTAL0_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_XTAL0_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
